/*
* MySQL dump 10.13  Distrib 5.6.26, for osx10.8 (x86_64)
* Host: localhost    Database: ProductMaster
*/ 


/*  Autocommit mode false*/
SET AUTOCOMMIT = 0;

/*  Create user */
DROP USER 'tmuser';
CREATE USER tmuser IDENTIFIED BY 'tmuser';

/*  Create Database & Grant */
DROP DATABASE IF EXISTS `product_master`;
CREATE DATABASE `product_master`;

USE 'product_master';

GRANT ALL PRIVILEGES ON product_master.* TO tmuser IDENTIFIED BY 'tmuser';


/*  Table structure for table `tm_product_info`*/
DROP TABLE IF EXISTS `tm_product_info`;

CREATE TABLE `tm_product_info` (
  `prd_id` char(8) NOT NULL,
  `prd_type` varchar(10) NOT NULL,
  `prd_name` varchar(50) NOT NULL,
  `price` int(7) NOT NULL,
  `description` varchar(200) DEFAULT NULL,
  `insert_date` date NOT NULL,
  `update_date` date DEFAULT NULL,
  PRIMARY KEY (`prd_id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;


/*  Dumping data for table `tm_product_info` */
 
/* INSERT INTO `tm_product_info` VALUES ('tmb00001','万年筆','万年筆A',45000,'ペン先・インク別売り','2015-10-25',NULL),('tmb00002','万年筆','万年筆B',65000,'ペン先・インク別売り','2015-10-25',NULL),('tmb00003','万年筆','万年筆C',85000,'ペン先・インク別売り','2015-10-25',NULL),('tmb00004','万年筆','万年筆D',105000,'ペン先・インク別売り','2015-10-25',NULL),('tmb00005','鉛筆','鉛筆A(HB)',20,'戸松イチオシ商品','2015-10-25',NULL),('tmb00006','鉛筆','鉛筆A(B)',20,'戸松イチオシ商品','2015-10-25',NULL),('tmb00007','鉛筆','鉛筆A(2B)',20,'戸松イチオシ商品','2015-10-25',NULL),('tmb00008','鉛筆','鉛筆A(3B)',20,'戸松イチオシ商品','2015-10-25',NULL),('tmb00009','鉛筆','鉛筆A(4B)',20,'戸松イチオシ商品','2015-10-25',NULL),('tmb00010','鉛筆','鉛筆B(HB)',25,NULL,'2015-10-25',NULL),('tmb00011','鉛筆','鉛筆B(B)',25,NULL,'2015-10-25',NULL),('tmb00012','鉛筆','鉛筆B(2B)',25,NULL,'2015-10-25',NULL),('tmb00013','鉛筆','鉛筆B(3B)',25,NULL,'2015-10-25',NULL),('tmb00014','鉛筆','鉛筆B(4B)',25,NULL,'2015-10-25',NULL),('tmb00015','鉛筆','鉛筆C(HB)',30,'セール商品','2015-10-25',NULL),('tmb00016','鉛筆','鉛筆C(B)',30,'セール商品','2015-10-25',NULL),('tmb00017','鉛筆','鉛筆C(2B)',30,'セール商品','2015-10-25',NULL),('tmb00018','鉛筆','鉛筆C(3B)',30,'セール商品','2015-10-25',NULL),('tmb00019','鉛筆','鉛筆C(4B)',30,'セール商品','2015-10-25',NULL),('tmb00020','鉛筆','鉛筆D(HB)',35,NULL,'2015-10-25',NULL),('tmb00021','鉛筆','鉛筆D(B)',35,NULL,'2015-10-25',NULL),('tmb00022','鉛筆','鉛筆D(2B)',35,NULL,'2015-10-25',NULL),('tmb00023','鉛筆','鉛筆D(3B)',35,NULL,'2015-10-25',NULL),('tmb00024','鉛筆','鉛筆D(4B)',35,NULL,'2015-10-25',NULL),('tmb00025','鉛筆','鉛筆E(HB)',40,NULL,'2015-10-25',NULL),('tmb00026','鉛筆','鉛筆E(B)',40,NULL,'2015-10-25',NULL),('tmb00027','鉛筆','鉛筆E(2B)',40,NULL,'2015-10-25',NULL),('tmb00028','鉛筆','鉛筆E(3B)',40,NULL,'2015-10-25',NULL),('tmb00029','鉛筆','鉛筆E(4B)',40,NULL,'2015-10-25',NULL),('tmb00030','鉛筆','鉛筆F(HB)',1500,'最高級鉛筆「弘法」シリーズ','2015-10-25',NULL),('tmb00031','鉛筆','鉛筆F(B)',1500,'最高級鉛筆「弘法」シリーズ','2015-10-25',NULL),('tmb00032','鉛筆','鉛筆F(2B)',1500,'最高級鉛筆「弘法」シリーズ','2015-10-25',NULL),('tmb00033','鉛筆','鉛筆F(3B)',1500,'最高級鉛筆「弘法」シリーズ','2015-10-25',NULL),('tmb00034','鉛筆','鉛筆F(4B)',1500,'最高級鉛筆「弘法」シリーズ','2015-10-25',NULL),('tmb00035','鉛筆','色鉛筆セットA(12色)',500,'戸松イチオシ商品','2015-10-25',NULL),('tmb00036','鉛筆','色鉛筆セットA(24色)',1000,'戸松イチオシ商品','2015-10-25',NULL),('tmb00037','鉛筆','色鉛筆セットA(36色)',1500,'戸松イチオシ商品','2015-10-25',NULL),('tmb00038','鉛筆','色鉛筆セットA(48色)',2000,'戸松イチオシ商品','2015-10-25',NULL),('tmb00039','鉛筆','色鉛筆セットB(12色)',600,NULL,'2015-10-25',NULL),('tmb00040','鉛筆','色鉛筆セットB(24色)',1200,NULL,'2015-10-25',NULL),('tmb00041','鉛筆','色鉛筆セットB(36色)',1800,NULL,'2015-10-25',NULL),('tmb00042','鉛筆','色鉛筆セットB(48色)',2400,NULL,'2015-10-25',NULL),('tmb00043','鉛筆','色鉛筆セットC(12色)',700,'セール商品','2015-10-25',NULL),('tmb00044','鉛筆','色鉛筆セットC(24色)',1400,'セール商品','2015-10-25',NULL),('tmb00045','鉛筆','色鉛筆セットC(36色)',2100,'セール商品','2015-10-25',NULL),('tmb00046','鉛筆','色鉛筆セットC(48色)',2800,'セール商品','2015-10-25',NULL),('tmb00047','鉛筆','色鉛筆セットD(12色)',800,NULL,'2015-10-25',NULL),('tmb00048','鉛筆','色鉛筆セットD(24色)',1600,NULL,'2015-10-25',NULL),('tmb00049','鉛筆','色鉛筆セットD(36色)',2400,NULL,'2015-10-25',NULL),('tmb00050','鉛筆','色鉛筆セットD(48色)',3200,NULL,'2015-10-25',NULL),('tmb00051','鉛筆','色鉛筆セットE(12色)',900,NULL,'2015-10-25',NULL),('tmb00052','鉛筆','色鉛筆セットE(24色)',1800,NULL,'2015-10-25',NULL),('tmb00053','鉛筆','色鉛筆セットE(36色)',2700,NULL,'2015-10-25',NULL),('tmb00054','鉛筆','色鉛筆セットE(48色)',3600,NULL,'2015-10-25',NULL),('tmb00055','鉛筆','色鉛筆セットF(12色)',5000,'最高級色鉛筆「色職人」シリーズ','2015-10-25',NULL),('tmb00056','鉛筆','色鉛筆セットF(24色)',10000,'最高級色鉛筆「色職人」シリーズ','2015-10-25',NULL),('tmb00057','鉛筆','色鉛筆セットF(36色)',15000,'最高級色鉛筆「色職人」シリーズ','2015-10-25',NULL),('tmb00058','鉛筆','色鉛筆セットF(48色)',20000,'最高級色鉛筆「色職人」シリーズ','2015-10-25',NULL),('tmb00059','シャーペン','シャーペンA',80,NULL,'2015-10-25',NULL),('tmb00060','シャーペン','シャーペンB',90,'戸松・月間MVP商品','2015-10-25',NULL),('tmb00061','シャーペン','シャーペンC',100,NULL,'2015-10-25',NULL),('tmb00062','シャーペン','シャーペンD',110,NULL,'2015-10-25',NULL),('tmb00063','シャーペン','シャーペンE',120,NULL,'2015-10-25',NULL),('tmb00064','シャーペン','シャーペンF',150,NULL,'2015-10-25',NULL),('tmb00065','シャーペン','シャーペンG',180,NULL,'2015-10-25',NULL),('tmb00066','シャーペン','シャーペンH',200,NULL,'2015-10-25',NULL),('tmb00067','シャーペン','シャーペンI',300,NULL,'2015-10-25',NULL),('tmb00068','シャーペン','シャーペンJ',8000,'最高級シャープペンシル「Sherlock」シリーズ','2015-10-25',NULL),('tmb00069','ボールペン','ボールペンA',90,NULL,'2015-10-25',NULL),('tmb00070','ボールペン','ボールペンB',100,'戸松・月間MVP商品','2015-10-25',NULL),('tmb00071','ボールペン','ボールペンC',110,NULL,'2015-10-25',NULL),('tmb00072','ボールペン','ボールペンD',120,NULL,'2015-10-25',NULL),('tmb00073','ボールペン','ボールペンE',150,'品切れ中。次回入荷時期未定。','2015-10-25',NULL),('tmb00074','ボールペン','ボールペンE',180,'品切れ中。次回入荷時期未定。','2015-10-25',NULL),('tmb00075','ボールペン','ボールペンE',200,'品切れ中。次回入荷時期未定。','2015-10-25',NULL),('tmb00076','ボールペン','ボールペンE',250,NULL,'2015-10-25',NULL),('tmb00077','ボールペン','ボールペンE',300,NULL,'2015-10-25',NULL),('tmb00078','ボールペン','ボールペンE',500,NULL,'2015-10-25',NULL),('tmb00079','ボールペン','ボールペンE',1000,NULL,'2015-10-25',NULL),('tmb00080','ボールペン','ボールペンE',10000,'最高級ボールペン「Elizabeth」シリーズ','2015-10-25',NULL),('tmb00081','消しゴム','消しゴムA（小）',50,'戸松イチオシ商品','2015-10-25',NULL),('tmb00082','消しゴム','消しゴムA（中）',100,'戸松イチオシ商品','2015-10-25',NULL),('tmb00083','消しゴム','消しゴムA（大）',150,'戸松イチオシ商品','2015-10-25',NULL),('tmb00084','消しゴム','消しゴムA（特大）',200,'戸松イチオシ商品','2015-10-25',NULL),('tmb00085','消しゴム','消しゴムB（小）',70,NULL,'2015-10-25',NULL),('tmb00086','消しゴム','消しゴムB（中）',140,NULL,'2015-10-25',NULL),('tmb00087','消しゴム','消しゴムC（大）',210,NULL,'2015-10-25',NULL),('tmb00088','消しゴム','消しゴムD（特大）',280,NULL,'2015-10-25',NULL),('tmb00089','消しゴム','消しゴムA（小）',100,'戸松・オブ・ザ・イヤー２年連続受賞','2015-10-25',NULL),('tmb00090','消しゴム','消しゴムB（中）',200,'戸松・オブ・ザ・イヤー２年連続受賞','2015-10-25',NULL),('tmb00091','消しゴム','消しゴムC（大）',300,'戸松・オブ・ザ・イヤー２年連続受賞','2015-10-25',NULL),('tmb00092','消しゴム','消しゴムD（特大）',400,'戸松・オブ・ザ・イヤー２年連続受賞','2015-10-25',NULL),('tmb00093','消しゴム','消しゴムA（小）',1000,'最高級消しゴム「消姫」シリーズ','2015-10-25',NULL),('tmb00094','消しゴム','消しゴムB（中）',2000,'最高級消しゴム「消姫」シリーズ','2015-10-25',NULL),('tmb00095','消しゴム','消しゴムC（大）',3000,'最高級消しゴム「消姫」シリーズ','2015-10-25',NULL),('tmb00096','消しゴム','消しゴムD（特大）',4000,'最高級消しゴム「消姫」シリーズ','2015-10-25',NULL),('tmb00097','消しゴム','香り付き消しゴムA',100,'2014年度 戸松・オブ・ザ・イヤー受賞商品','2015-10-25',NULL),('tmb00098','消しゴム','香り付き消しゴムB',200,'2014年度 戸松・オブ・ザ・イヤー受賞商品','2015-10-25',NULL),('tmb00099','消しゴム','香り付き消しゴムC',300,'2014年度 戸松・オブ・ザ・イヤー受賞商品','2015-10-25',NULL),('tmb00100','消しゴム','香り付き消しゴムD',400,'2014年度 戸松・オブ・ザ・イヤー受賞商品','2015-10-25',NULL);
*/
LOAD DATA INFILE "C:/dbddl/product_list.csv"
INTO TABLE tm_product_info FIELDS TERMINATED BY ","
LINES TERMINATED BY "\r\n";

UPDATE tm_product_info SET update_date = NULL;
COMMIT;

/*  Table structure for table `tm_user` */

DROP TABLE IF EXISTS `tm_user`;

CREATE TABLE `tm_user` (
  `user_id` char(5) NOT NULL,
   user_name varchar(20) NOT NULL,
  `password` varchar(8) NOT NULL,
  PRIMARY KEY (`user_id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

 
/*  Dumping data for table `tm_user` */

INSERT INTO `tm_user` VALUES ('tm001','戸松太郎','tm001'),('tm002','ゲスト','tm002');
COMMIT;
